{"output_attentions": false, "output_hidden_states": false, "use_cache": true, "torchscript": false, "use_bfloat16": false, "pruned_heads": {}, "is_encoder_decoder": false, "is_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "architectures": ["BertForMaskedLM"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "xla_device": null, "model_type": "bert", "vocab_size": 28996, "hidden_size": 768, "num_hidden_layers": 12, "num_attention_heads": 12, "hidden_act": "gelu", "intermediate_size": 3072, "hidden_dropout_prob": 0.1, "attention_probs_dropout_prob": 0.1, "max_position_embeddings": 512, "type_vocab_size": 2, "initializer_range": 0.02, "layer_norm_eps": 1e-12}